Map<String, List<String>> synonyms = {
  'منزل': ['بيت', 'المنزل', 'البيت'],
  'سيارة': ['عربة', 'مركبة', 'العربة', 'المركبة'],
  'قطة': [
    'دم ',
    'دم',
    'دمه ',
    'دمه',
    'هرهور',
    'هرهور ',
    'هر',
    'هر ',
    'هريره',
    'هريره ',
    'هره',
    'هره ',
    'نسمي',
    'نسمي ',
    'نسمه',
    'نسمه ',
    'مياو ',
    'مياو',
    'بسه ',
    'بسه',
    'بس ',
    'بس'
  ],

  'كلب': ['هوهو', 'هوهو ', 'نباح', 'نباح ', 'كلوب', 'كلوب ', 'كلبي', 'جرو'],
  'حصان': ['فرس', 'فرس ', 'خيل', 'خيل ', 'جواد', 'جواد ', 'مهر', 'مهر '],
  'حمار': ['حمير', 'حمير ', 'البغل', 'البغل ', 'بغل', 'بغل '],
  'بقرة': ['عجل', 'عجل ', 'ثور', 'ثور ', 'بقره', 'بقره ', 'بقر'],
  'خروف': ['خروف', 'خروف ', 'نعجة', 'نعجة ', 'غنمه', 'غنمه ', 'غنم ', 'كسبه'],
  'جمل': [
    'بعير',
    'بعير ',
    'جمال',
    'جمال ',
    'الإبل',
    'الإبل ',
    'ابل',
    'الزمل',
    'ناقه'
  ],
  'دجاجة': [
    'دجاج',
    'دجاج ',
    'دججه',
    'دججه ',
    'الفرخة',
    'الفرخة ',
    'فرخه',
    'كوكو'
  ],
  'أسد': ['ليث', 'ليث ', 'سبع', 'سبع ', 'الاسد', 'الاسد ', 'الأسد', 'ضرغام'],
  'فأر': ['جرذ', 'جرذ ', 'الفار', 'الفار ', 'فار', 'فار '],
  'عصفور': [
    'طير', 'طير ', 'عصفور', 'عصفور ', 'عصافير', 'عصافير ', 'طير ',
    'بلبل', // لهجة شامية
    'زغنون', // لهجة مغربية
    'ياسمين', // لهجة مغربية
  ],
  'ذئب': ['سبع', 'ذيب'],
  'ثعلب': ['مكار', 'الماكر'],
  'أرنب': ['الخرنق', 'خرنق', 'الارنب'],
  'نمر': ['ببر', 'نمرود'],
  'زرافة': ['الزراف'],
  'فيل': ['الفيل', 'الضخم'],
  'غزال': [
    'ريم', // فصحى
    'ظبي', // فصحى
    'السرحان', // لهجة مغربية
  ],
  'ضبع': ['ضباع'],
  'خنزير': ['خنازير'],
  'بط': ['بطة', 'البط'],
  'وز': [
    'اوزة', // فصحى
    'الاوز', // فصحى وعامة
    'الكواك', // لهجة مغربية
  ],
  'بومة': ['الليل', 'الليلي'],
  'نحلة': ['نحل'],
  'دب': ['الدب', 'دبدوب', 'دبدوب', 'دببه'],
  'تمساح': ['تماسيح'],
  'سلحفاة': ['السلاحف'],
  'ثعبان': [
    'حية', // فصحى
    'افعى', // فصحى
    'العقرب', // لهجة مغربية
    'حنش'
  ],
  'عقرب': [
    'لساع', // فصحى
    'السم', // لهجة مصرية
  ],
  'نسر': ['عقاب'],

  // أضف المزيد من المرادفات هنا
};
